In [21]:
import pandas as pd
import gc

In [22]:
df_tokyoMedals = pd.read_csv(r"D:\Python Projects\Python ETL\Olympics\Tokyo Medals 2021.csv")

In [23]:
df_tokyoMedals.head()

,Country,Gold Medal,Silver Medal,Bronze Medal,Total,Rank By Total
0,United States of America,39,41,33,113,1
1,People's Republic of China,38,32,18,88,2
2,Japan,27,14,17,58,5
3,Great Britain,22,21,22,65,4
4,ROC,20,28,23,71,3

In [24]:
df_tokyoMedals.dtypes

Country          object
Gold Medal        int64
Silver Medal      int64
Bronze Medal      int64
Total             int64
Rank By Total     int64
dtype: object

In [44]:
df_tokyoMedalsUS = df_tokyoMedals.loc[df_tokyoMedals['Country'] == 'United States of America']

In [45]:
df_tokyoMedalsUS.head()

,Country,Gold Medal,Silver Medal,Bronze Medal,Total,Rank By Total
0,United States of America,39,41,33,113,1

In [47]:
df_tokyoMedalsTop3 = df_tokyoMedals.nlargest(3, columns='Gold Medal')

In [49]:
df_tokyoMedalsTop3.head()

,Country,Gold Medal,Silver Medal,Bronze Medal,Total,Rank By Total
0,United States of America,39,41,33,113,1
1,People's Republic of China,38,32,18,88,2
2,Japan,27,14,17,58,5

In [ ]:
del df_tokyoMedalsTop3, df_tokyoMdedalsUS, df_tokyoMedals

In [ ]:
gc.collect()